In [20]:
stu_details = {'stu_id':[1,2,3,4,5], 
              'stu_name':['A','B','C','D','E'],
              'Region':['N','S','W','E','S']}

stu_marks = {'st_id':[1,2,3,4,6],
            'sub':['Py','Tab','R','Py','Py'],
            'Marks':[35,32,34,37,38]}

In [3]:
stu_details

{'st_id': [1, 2, 3, 4, 5],
 'stu_name': ['A', 'B', 'C', 'D', 'E'],
 'Region': ['N', 'S', 'W', 'E', 'S']}

In [4]:
stu_marks

{'st_id': [1, 2, 3, 4, 6],
 'sub': ['Py', 'Tab', 'R', 'Py', 'Py'],
 'Marks': [35, 32, 34, 37, 38]}

In [5]:
import pandas as pd

In [6]:
pd.__version__

'1.0.3'

In [21]:
stu_details = pd.DataFrame(stu_details)

In [9]:
type(stu_details)

pandas.core.frame.DataFrame

In [22]:
stu_marks = pd.DataFrame(stu_marks)

In [12]:
stu_marks

   st_id  sub  Marks
0      1   Py     35
1      2  Tab     32
2      3    R     34
3      4   Py     37
4      6   Py     38

In [23]:
stu_details

   stu_id stu_name Region
0       1        A      N
1       2        B      S
2       3        C      W
3       4        D      E
4       5        E      S

In [24]:
stu_marks

   st_id  sub  Marks
0      1   Py     35
1      2  Tab     32
2      3    R     34
3      4   Py     37
4      6   Py     38

In [26]:
pd.merge(stu_details,stu_marks, left_on='stu_id',right_on='st_id', how='inner')

   stu_id stu_name Region  st_id  sub  Marks
0       1        A      N      1   Py     35
1       2        B      S      2  Tab     32
2       3        C      W      3    R     34
3       4        D      E      4   Py     37

In [17]:
pd.merge(stu_details,stu_marks, on='st_id', how='left')

   st_id stu_name Region  sub  Marks
0      1        A      N   Py   35.0
1      2        B      S  Tab   32.0
2      3        C      W    R   34.0
3      4        D      E   Py   37.0
4      5        E      S  NaN    NaN

In [18]:
pd.merge(stu_details,stu_marks, on='st_id', how='right')

   st_id stu_name Region  sub  Marks
0      1        A      N   Py     35
1      2        B      S  Tab     32
2      3        C      W    R     34
3      4        D      E   Py     37
4      6      NaN    NaN   Py     38

In [19]:
pd.merge(stu_details,stu_marks, on='st_id', how='outer')

   st_id stu_name Region  sub  Marks
0      1        A      N   Py   35.0
1      2        B      S  Tab   32.0
2      3        C      W    R   34.0
3      4        D      E   Py   37.0
4      5        E      S  NaN    NaN
5      6      NaN    NaN   Py   38.0

In [28]:
stu_details_Nag = {'st_id':[1,2,3,4,5],
                  'stu_name':['A','B','C','D','E'],
                  'sub':['Py','Tab','Py','Tab','PY']}

stu_details_US = {'st_id':[6,7,8,9,10],
                  'stu_name':['T','Y','U','I','O'],
                  'sub':['Tab','Tab','Tab','SQL','PY']}

In [30]:
stu_details_Nag=pd.DataFrame(stu_details_Nag)

In [31]:
stu_details_US=pd.DataFrame(stu_details_US)

In [32]:
stu_details_Nag

   st_id stu_name  sub
0      1        A   Py
1      2        B  Tab
2      3        C   Py
3      4        D  Tab
4      5        E   PY

In [33]:
stu_details_US

   st_id stu_name  sub
0      6        T  Tab
1      7        Y  Tab
2      8        U  Tab
3      9        I  SQL
4     10        O   PY

In [39]:
student_details = pd.concat([stu_details_Nag, stu_details_US],axis=0)

In [45]:
student_details.reset_index()

   index  st_id stu_name  sub
0      0      1        A   Py
1      1      2        B  Tab
2      2      3        C   Py
3      3      4        D  Tab
4      4      5        E   PY
5      0      6        T  Tab
6      1      7        Y  Tab
7      2      8        U  Tab
8      3      9        I  SQL
9      4     10        O   PY

In [46]:
student_details = pd.concat([stu_details_Nag, stu_details_US],axis=1)

In [47]:
student_details

   st_id stu_name  sub  st_id stu_name  sub
0      1        A   Py      6        T  Tab
1      2        B  Tab      7        Y  Tab
2      3        C   Py      8        U  Tab
3      4        D  Tab      9        I  SQL
4      5        E   PY     10        O   PY